Tekla Open API Reference for Tekla Structures 2025
BasePoint.Delete Method
 Deletes the base point from the model database.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Delete()
Public Function Delete As Boolean
Return Value
Type: Boolean
True on success, otherwise false.
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace